Projects/Join_Typ/output/logs/int_queries/int_queries_insert_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 0.00 qps: 31305.41 (r/w/o: 0.00/4034.04/27271.37) lat (ms,95%): 0.00 err/s: 16.65 reconn/s: 0.00
[ 6s ] thds: 8 tps: 2.67 qps: 32216.96 (r/w/o: 0.00/4131.14/28085.82) lat (ms,95%): 0.00 err/s: 14.01 reconn/s: 0.00
[ 9s ] thds: 8 tps: 0.00 qps: 33678.26 (r/w/o: 0.00/4209.78/29468.47) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 2.67 qps: 32948.75 (r/w/o: 0.00/4247.16/28701.59) lat (ms,95%): 0.00 err/s: 21.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 0.00 qps: 35293.30 (r/w/o: 0.00/4411.66/30881.64) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 2.67 qps: 32708.56 (r/w/o: 0.00/4193.17/28515.39) lat (ms,95%): 0.00 err/s: 16.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 0.00 qps: 35308.00 (r/w/o: 0.00/4413.50/30894.50) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           90552
        other:                           622871
        total:                           713423
    transactions:                        32     (1.50 per sec.)
    queries:                             713423 (33374.18 per sec.)
    ignored errors:                      203    (9.50 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.3763s
    total number of events:              32

Latency (ms):
         min:                                 5249.55
         avg:                                 5343.68
         max:                                 5464.25
         95th percentile:                        0.00
         sum:                               170997.91

Threads fairness:
    events (avg/stddev):           4.0000/0.00
    execution time (avg/stddev):   21.3747/0.00