Projects/Join_Typ/output/logs/int_queries/int_queries_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 481.12 qps: 481.12 (r/w/o: 481.12/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 489.64 qps: 489.64 (r/w/o: 489.64/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 487.05 qps: 487.05 (r/w/o: 487.05/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 486.43 qps: 486.43 (r/w/o: 486.43/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 482.96 qps: 482.96 (r/w/o: 482.96/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 412.22 qps: 412.22 (r/w/o: 412.22/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 468.37 qps: 468.37 (r/w/o: 468.37/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            9932
        write:                           0
        other:                           0
        total:                           9932
    transactions:                        9932   (472.62 per sec.)
    queries:                             9932   (472.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0145s
    total number of events:              9932

Latency (ms):
         min:                                   13.09
         avg:                                   16.92
         max:                                   58.40
         95th percentile:                        0.00
         sum:                               168048.77

Threads fairness:
    events (avg/stddev):           1241.5000/4.80
    execution time (avg/stddev):   21.0061/0.00